//
//  Flowers .swift
//  اسقني
//
//  Created by بدرية موسى العجمي on 7/17/20.
//  Copyright © 2020 Moon. All rights reserved.
//

import Foundation

struct Flowers {
    var Name : String
    var HowToGrow : String
    var PlantType : String
    var NativeArea : String
    var SunExposure : String
}


struct HowToGrowPlant {
    var Info = [
   
        //موناردة
          "إسم النبات : مونارده الاسم الاتينى : monarda didyma نبذه عامه : هو نبات ذو أزهار جميله ورديه اللون تستخدم فى الزينه كما تستخدم ألأوراقه فى الشراب و الحلوى نبذه تاريخيه : إكتشف فى أمريكا الشماليه و إستخدم ليحل محل الشاى أثناء ا لأزمه بين المستعمرات الأمريكيه و إنجلترا ، سمين مونارده لأن مكتشفها هو عالم النبات البريطانى نيكولاس مونارديس فتره الحياه : طوال لعام ظروف الزراعه : فى مناخ مشمس و حار و فى أرض مسمده جيدا و رطبه المحصول : يزرع فى آخر الربيع و أول الصيف و تجمع الأوراق قبل التزهير البذور : البذور صغيره و لنها بنى غامق و تستخدم لإعاده زراعه النبات الساق : صلبه و لونها أخضر غامق و مغطاه بشعيرات رفيعه عند إتحاده مع الورقه يصبح لونه نبيتى غامق الورق : لونها أخضر غامق و فيها بعض الخطوط النبيتيه الإستخدامات فى المطبخ : تضاف لكوكتيل الفواكه لإعطائها طعم مميز كما تضاف الأوراق للسلطات إستخدامات فى المنزل : هذاالنبات يجذب النحل و الفراش إستخدامات فى الطب : تناول شراب من إلى أوراقه يخفف من مشاكل الهضم إستخدامات فى الزينه : تستخدم الأوراق و الأزهار فى عمل أكاليل الزهور",
    //بيغونيا
    "مع 1،831 نوعًا ، تعتبر Begonia واحدة من   أكبر أجناس النباتات المزهرة. الأنواع هي الأعشاب الأرضية (في بعض الأحيان الوعائية) أو الشجيرات ، وتحدث في المناخات الرطبة شبه الاستوائية والاستوائية ، في أمريكا الجنوبية والوسطى ، وأفريقيا ، وجنوب آسيا. الأنواع البرية في البرية عادة ما تكون جذعية أو جذرية أو درنية. النباتات أحادية ، مع وجود أزواج من الذكور والإناث على حدة على نفس النبات ؛ يحتوي الذكر على العديد من الأسدية ، ولدى الأنثى مبيض سفلي كبير واثنين إلى أربعة وصمات متفرعة أو ملتوية. في معظم الأنواع ، الفاكهة عبارة عن كبسولة مجنحة تحتوي على العديد من البذور الدقيقة ، على الرغم من أن ثمار البكات معروفة أيضًا. عادة ما تكون الأوراق ، التي غالبًا ما تكون كبيرة ومختلفة أو متباينة ، غير متماثلة (غير متساوية الجانب)",
    //جلارديا
        "هو جنس من النباتات المزهرة في عائلة عباد الشمس، موطنها الأصلي في أمريكا الشمالية والجنوبية. سميت على اسم Maître Gaillard de Charentonneau ، قاضي فرنسي من القرن الثامن عشر كان عالم نباتات متحمس. قد يشير الاسم الشائع إلى تشابه الإزهار مع البطانيات المنقوشة الزاهية التي صنعها الأمريكيون الأصليون ، أو إلى قدرة الأصناف البرية على تغطية الأرض بالمستعمرات. تم تربية العديد من الأصناف لاستخدامها في الزينة.يمكن أن تكون تقريبًا أي ظل أصفر أو برتقالي أو أحمر أو أرجواني أو بني أو أبيض أو ثنائي اللون. يتم إدخالها في بعض الأحيان في شكل قمع. يوجد العديد من الزهيرات القرصية الأنبوبية في وسط الرأس بمجموعة متشابهة من الألوان ، وعادة ما تكون مملوءة بالشعر. عادةً ما تحتوي الفاكهة على قشور من pappus"
    ]
}

var FlowerInfo = [
    Flowers(Name: "موناردة"+"jpg", HowToGrow: "0", PlantType: "الدائمة", NativeArea: "North America"
        , SunExposure: "شمس ساطعة"),
    
    Flowers(Name: "بيغونيا"+"jpg", HowToGrow: "1", PlantType: "معمر عشبي", NativeArea: "غير متاح ؛ هذا نبات هجين", SunExposure: "لا تزدهر في ضوء الشمس القوي"),
    
    Flowers(Name: "غيردية"+"jpg", HowToGrow: "2", PlantType:  "الدائمة", NativeArea: "North America", SunExposure: "شمس ساطعة"),
    ]
